src/main/java/net/tedata/webservices/fe_getactiondestinationforcustomer/test.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>DP</wsse:Username>
                <wsse:Password>DP</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <S:Body>
        <ns3:FE_getActionDestinationForCustomerRequest xmlns:ns2="http://webservices.tedata.net/V3/TEDATACommonTypes"
            xmlns:ns3="http://webservices.tedata.net/FE_GetActionDestinationForCustomer">
            <MessageHeader xmlns="">
                <ns2:channelID>a</ns2:channelID>
            </MessageHeader>
            <MessageBody xmlns="">
                <referenceSystem>0</referenceSystem>
                <customerNumber>123123</customerNumber>
            </MessageBody>
        </ns3:FE_getActionDestinationForCustomerRequest>
    </S:Body>
</S:Envelope>